{
    "1": [
        "Hey you, you're finally online! I've seen your skills and I could use your assistance.\n",
        "I need you to delete some data from a server.\n",
        "I don't have write access so I need you to help me out.\n",
        "The server address is 18.127.11.23. There should be a file called 'connections.log.'\n",
        "Download the file to your computer and then delete it from the Gibson server.\n",
        "The file should be located where most log files are on UNIX systems.\n",
        "I'll message you again once you exit your terminal.\n"
    ],
    "1_FAIL": [
        "I can still see the user credentials on th Gibson file server.\n",
        "Were you not able to find it?\n",
        "Try looking in the /var/log/ location on the Gibson server.\n",
        "I need this file deleted. I'll message you again once you exit your terminal.\n"
    ],
    "2": [
        "Well done. I knew as soon as you pulled it off. Their IRC server has been busy with activity.\n",
        "You're going to need to connect to that IP address.\n",
        "Once you're connected, you'll need to delete their project files.\n",
        "I don't want them to keep developing their tools\n",
        "Delete anything with a .py or .c file extension.\n",
        "Before you disconnect, change the password for the account to 'hacked'.\n",
        "Let me know when you're done.\n"
    ],
    "2_FAIL_DELETE_FILES": [
        "I can still see the project files on Microsoft's server.\n",
        "Were you not able to find them?\n",
        "Try looking on the Desktop, Microsoft is lazy with their files.\n",
        "I need these files deleted. I'll message you again once you exit your terminal.\n"
    ],
    "2_FAIL_CHANGE_PASSWORD": [
        "I can still see the user credentials on the Microsoft file server.\n",
        "Were you not able to find the password file?\n",
        "Try looking in the /etc/ folder on the Microsoft server.\n",
        "Or you can use help to find a command to help change the password.\n",
        "Microsoft needs to pay for releasing Windows Vista.\n",
        "I'll message you again once you exit your terminal.\n"
    ],
    "3": [
        "Well it seems my intel was right, you certainly know your stuff.\n",
        "I have one last task for you.\n",
        "The security cameras in the building have picked up my informant.\n",
        "Log into the server that hosts the security system.\n",
        "Delete ONLY the footage of the mole. Anything else and they might get suspicious.\n",
        "I don't want any loose ends. Wrap this up cleanly and I'll have more work for you in the future.\n"
    ]
}
